Бухгалтерские_задачи_Занятие_5/src/ChartsOfAccounts/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Счета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары опт</description>
        <code>41.1</code>
      </childItems>
      <childItems>
        <name>ТоварыРозница</name>
        <description>Товары розница</description>
        <code>41.2</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>СчетВБанке</name>
      <description>Счет в банке</description>
      <code>51</code>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ПокупателямОтгрузили</name>
        <description>Покупателям отгрузили</description>
        <code>62.1</code>
      </childItems>
      <childItems>
        <name>АвансОтПокупателей</name>
        <description>Аванс от покупателей</description>
        <code>62.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ЗарплатаСотрудников</name>
      <description>Зарплата сотрудников</description>
      <code>70</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСУчредителями</name>
      <description>Расчеты с учредителями</description>
      <code>75</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>УставныйКапитал</name>
      <description>Уставный капитал</description>
      <code>80</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасходыДоходы</name>
      <description>Расходы доходы</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ХранениеТоваров</name>
      <description>Хранение товаров</description>
      <code>001</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>НеИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>ПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_Занятие_5/src/CommonModules/БухгалтерияВызовСервера/Module.bsl
Функция ПолучитьСвойствоСчета(Счет) Экспорт

	ДанныеСчета = Новый Структура;
	
	МаксКоличествоСубконто = Метаданные.ПланыСчетов.Счета.МаксКоличествоСубконто;

	ДанныеСчета.Вставить("МаксКоличествоСубконто", МаксКоличествоСубконто);


	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	СчетаВидыСубконто.Ссылка.Забалансовый,
		|	СчетаВидыСубконто.Ссылка.ПоПодразделениям,
		|	СчетаВидыСубконто.Ссылка.Количественный,
		|	СчетаВидыСубконто.Ссылка КАК Ссылка,
		|	СчетаВидыСубконто.ВидСубконто КАК ВидСубконто,
		|	СчетаВидыСубконто.ВидСубконто.Наименование,
		|	СчетаВидыСубконто.ВидСубконто.ИмяПредопределенныхДанных,
		|	СчетаВидыСубконто.ВидСубконто.ТипЗначения
		|ИЗ
		|	ПланСчетов.Счета.ВидыСубконто КАК СчетаВидыСубконто
		|ГДЕ
		|	СчетаВидыСубконто.Ссылка = &Ссылка
		|ИТОГИ
		|	КОЛИЧЕСТВО(ВидСубконто)
		|ПО
		|	Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Счет);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаСсылка.Следующий() Цикл

		ДанныеСчета.Вставить("Забалансовый", ВыборкаСсылка.Забалансовый);
		ДанныеСчета.Вставить("ПоПодразделениям", ВыборкаСсылка.ПоПодразделениям);
		ДанныеСчета.Вставить("Количественный", ВыборкаСсылка.Количественный);
		ДанныеСчета.Вставить("КоличествоСубконто", ВыборкаСсылка.ВидСубконто);


		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();

		Для Индекс = 1 По МаксКоличествоСубконто Цикл

			Если ВыборкаДетальныеЗаписи.Следующий() = Истина Тогда

				ДанныеСчета.Вставить("ВидСубконто"
					+ Индекс, ВыборкаДетальныеЗаписи.ВидСубконто);
				ДанныеСчета.Вставить("ВидСубконто" + Индекс
					+ "Наименование", ВыборкаДетальныеЗаписи.Наименование);
				ДанныеСчета.Вставить("ВидСубконто" + Индекс
					+ "ИмяПредопределенныхДанных", ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных);
				ДанныеСчета.Вставить("ВидСубконто" + Индекс
					+ "ТипЗначения", ВыборкаДетальныеЗаписи.ТипЗначения);

			Иначе

				ДанныеСчета.Вставить("ВидСубконто" + Индекс, Неопределено);
				ДанныеСчета.Вставить("ВидСубконто" + Индекс
					+ "Наименование", Неопределено);
				ДанныеСчета.Вставить("ВидСубконто" + Индекс
					+ "ИмяПредопределенныхДанных", Неопределено);
				ДанныеСчета.Вставить("ВидСубконто" + Индекс
					+ "ТипЗначения", Неопределено);

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;



	Возврат ДанныеСчета;

КонецФункции

// ()
